Catalogs/КлассификаторБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлассификаторБанков</Name>
			<Comment>АПК:58</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>Корреспондентский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеятельностьПрекращена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СВИФТБИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКРКЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодЦБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторБанков/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("*");
	Возврат Результат;
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ
// для элементов справочника.
//
// Возвращаемое значение:
//  Массив - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Код");
	Результат.Добавить("КоррСчет");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры) Экспорт
	
	Если Идентификатор <> ИдентификаторКлассификатора() Тогда
		Возврат;
	КонецЕсли;
	
	Обработан = Истина;
	
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

#КонецОбласти

// ЗУПК

// Возвращает полные данные классификатора.
//
// Возвращаемое значение:
//     ТаблицаЗначений - данные классификатора с колонками:
//         * Код                		- Строка - данные страны.
//         * Наименование 				- Строка - данные страны.
//         * Город          			- Строка - данные страны.
//
//     Таблица значений проиндексирована по полям "Код", "Наименование".
//
Функция ТаблицаКлассификатора() Экспорт
	
	Макет = Справочники.КлассификаторБанков.ПолучитьМакет("Классификатор");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
	
	Возврат СериализаторXDTO.ПрочитатьXML(Чтение);
	
КонецФункции

#Область ПроцедурыОбновления

// Проводит заполнение справочника ""КлассификаторБанков"" по макету:
// элементы проверяются по реквизиту ""Код"" и, в случае совпадения, проверяются (и перезаполняются, если нужно) другие реквизиты, снимается пометка удаления (если есть).
// Если элемент не найден, создается новый, значения заполняются по классификатору. 
// Элементы, присутствующие в справочнике, но отсутствующие в классификаторе на момент обновления, получают признак ""ДеятельностьПрекращена"".
Процедура ОбновлениеКлассификатора_ОбработатьДанные() Экспорт
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторБанков");
	Блокировка.Заблокировать();
	
	Попытка
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КлассификаторБанков.Ссылка КАК Ссылка,
		|	КлассификаторБанков.Родитель КАК Родитель,
		|	КлассификаторБанков.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.КлассификаторБанков КАК КлассификаторБанков";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МассивГрупп = Новый Массив();
		
		Пока Выборка.Следующий() Цикл
			ЭлементСправочника = Выборка.Ссылка.ПолучитьОбъект();
			Если Не Выборка.ЭтоГруппа Тогда 
				Если Не Выборка.Родитель.Пустая() Тогда
					ЭлементСправочника.Родитель = Справочники.КлассификаторБанков.ПустаяСсылка();
				КонецЕсли;
				ЭлементСправочника.ДеятельностьПрекращена = Истина;
			Иначе
				ЭлементСправочника.ПометкаУдаления = Истина;
			КонецЕсли;
			ЭлементСправочника.Записать();
		КонецЦикла;
			
		МассивДанныхКлассификатора = ПолучитьДанныеКлассификатора();
		
		Для Каждого ЭлементКлассификатора Из МассивДанныхКлассификатора Цикл
			
			ЭлементБанк = Справочники.КлассификаторБанков.НайтиПоКоду(ЭлементКлассификатора.Код);
			
			Если ЭлементБанк.Пустая() Тогда
				ЭлементСправочника = Справочники.КлассификаторБанков.СоздатьЭлемент();
				ЭлементСправочника.Код          = ЭлементКлассификатора.Код;
				ЭлементСправочника.Наименование = ЭлементКлассификатора.Наименование;
				ЭлементСправочника.ДеятельностьПрекращена = Ложь;
			Иначе	
				
				ЭлементСправочника = ЭлементБанк.ПолучитьОбъект();
				
				Если ЭлементСправочника.ПометкаУдаления Тогда
					ЭлементСправочника.ПометкаУдаления = Ложь;
				КонецЕсли;
				
				ЭлементСправочника.ДеятельностьПрекращена = Ложь;
				
				Если ЭлементСправочника.Наименование <> ЭлементКлассификатора.Наименование Тогда
					ЭлементСправочника.Наименование = ЭлементКлассификатора.Наименование;
				КонецЕсли;
				
			КонецЕсли;
			
			ЭлементСправочника.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ПолноеИмяОбъекта = "Справочник.КлассификаторБанков";
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
		
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить справочник ""Классификатор банков"" по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
		МетаданныеОбъекта, ТекстСообщения);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьДанныеКлассификатора()
	
	МассивДанныхКлассификатора = Новый Массив();
	
	ДанныеКлассификатора = КлассификаторБанков(); 
	
	Если ДанныеКлассификатора <> Неопределено Тогда
		Для Каждого Запись Из ДанныеКлассификатора Цикл
			ЭлементКлассификатора = Новый Структура();
			ЭлементКлассификатора.Вставить("Код", 			Запись.bankBIK);
			ЭлементКлассификатора.Вставить("Наименование",  Запись.bankName);
			
			МассивДанныхКлассификатора.Добавить(ЭлементКлассификатора);
		КонецЦикла; 
	Иначе
		Макет = Справочники.КлассификаторБанков.ПолучитьМакет("Классификатор");
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
		КлассификаторТаблица = СериализаторXDTO.ПрочитатьXML(Чтение);
		
		Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
			
			ЭлементКлассификатора = Новый Структура();
			ЭлементКлассификатора.Вставить("Код", 			СтрокаКлассификатора.Код);
			ЭлементКлассификатора.Вставить("Наименование",  СтрокаКлассификатора.Наименование);
			
			МассивДанныхКлассификатора.Добавить(ЭлементКлассификатора);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивДанныхКлассификатора;
	
КонецФункции

#КонецОбласти

#Область СервисКлассификаторов

Функция ИдентификаторКлассификатора() Экспорт
	
	Возврат "BanksKz";
	
КонецФункции 

Функция КлассификаторБанков() Экспорт 
	
	КлассификаторJSON = Неопределено;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.РаботаСКлассификаторами") Тогда
		ИдентификаторКлассификатора = ИдентификаторКлассификатора();
		
		МодульРаботаСКлассификаторами = ОбщегоНазначения.ОбщийМодуль("РаботаСКлассификаторами");
		Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторКлассификатора);
		Результат = МодульРаботаСКлассификаторами.ПолучитьФайлыКлассификаторов(Идентификаторы);
		
		Если ПустаяСтрока(Результат.КодОшибки) И Результат.ДанныеКлассификаторов <> Неопределено Тогда
			ОписаниеКлассификатора = Результат.ДанныеКлассификаторов.Найти(ИдентификаторКлассификатора, "Идентификатор");
			Если ОписаниеКлассификатора <> Неопределено Тогда
				
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеКлассификатора.АдресФайла);
				Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.ОткрытьПоток(Поток);
				ДанныеКлассификатора = ПрочитатьJSON(ЧтениеJSON); 
				КлассификаторJSON = ДанныеКлассификатора.response;
				ЧтениеJSON.Закрыть();
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = КлассификаторJSON;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// ЗУПК

#КонецОбласти

#КонецЕсли
